[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab11",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 9.99,
    "course_title": "Hackers Exposed!",
    "author": {
      "name": "Nethan House",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "",
    "course_description": "Learn a practical skill set in defeating all online threats, including - advanced hackers, trackers, malware, zero days, exploit kits, cybercriminals, and more. Become a Cyber Security Specialist - Go from beginner to advance in this easy-to-follow expert course. Covering all major platforms - Windows 7, Windows 8, Windows 10, macOS, and Linux. This course covers the fundamental building blocks of your required skill set - You will understand the threat and vulnerability landscape through threat modeling and risk assessments. We explore the Darknet and the mindset of the cyber-criminal. Covering malware, exploit kits, phishing, zero-day vulnerabilities, and much more. You will learn about the global tracking and hacking infrastructures that nation-states run. Covering the NSA, FBI, CIA, GCHQ, China’s MSS, and other intelligence agencies' capabilities. You will understand the foundations of operating system security and privacy functionality. A close look at the new Windows 10 privacy issues and how to best mitigate them. There is a complete easy-to-follow crash course on encryption, how encryption can be bypassed and what you can do to mitigate the risks."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab22",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 3.99,
    "course_title": "Network Security!",
    "author": {
      "name": "Muhit sharma",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "",
    "course_description": "Become a cyber security specialist. After this course, you will be able to discover security vulnerabilities across an entire network, by using network hacking techniques and vulnerability scanning. You will be able to architect your network for maximum security and prevent local and remote attacks. We also cover the use of custom router firmware to provide you with better network security services. You will understand the various types of firewalls that are available and what threats each help mitigate. Including layer 4 firewalls like Iptables on Linux and PF on MacOS and BSD. Virtual firewalls, host-based firewalls, and application-based firewalls like Pence. We cover firewalls on all platforms including Windows, Mac OS X, and Linux for all types of use scenarios."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab33",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 4.99,
    "course_title": "Anonymous Browsing!",
    "author": {
      "name": "Rohit",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "",
    "course_description": "Advanced anonymity: We explore chaining and nesting anonymizing services together to provide layers of obfuscation for maximum anonymity against even the most well-resourced adversaries. We cover bypassing censors, firewalls, and proxies. Learn to bypass the trickiest of censoring devices including DPI (deep packet inspection). The course covers both the theory and practically how setup everything we discuss.   "
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab44",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 7.99,
    "course_title": "End Point Protection!",
    "author": {
      "name": "Rakib",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "",
    "course_description": "Learn a practical skill set in securing laptops, desktops, and mobile devices from all types of threats, including, advanced hackers, trackers, exploit kits, thieves, and much more. In this course, we cover end-point-protection, which is an extremely important and hot topic in cyber security right now! Become a cyber security specialist - Go from beginner to advance in this easy-to-follow expert course. Covering all the major platforms Windows, macOS, Linux, iOS, and Android. Master the selection and implementation of solid disk encryption technology to protect devices from disk decryption attacks."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab55",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 2.99,
    "course_title": "Ethical Hacking",
    "author": {
      "name": "Jorge",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "",
    "course_description": "What will you learn in this “Complete Ethical Hacking and Cyber Security Master Class. In short, you'll learn it all! Seriously, our goal is to make the most comprehensive Ethical Hacking course out there - not filled with fluff, but filled with only the most actionable and latest tips and strategies. We'll be updating this course periodically to make sure we're covering any change with Ethical Hacking and Cyber Security. You'll start by an overview of Ethical Hacking and Cyber security, learn 2 types of attacks, install Virtual Box 6.0 and Kali Linux. You'll then learn Linux basics like the Linux environment, terminal commands, configuring IP addresses and network settings, Cat, Echo, APT-get and more…"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab66",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 10.99,
    "course_title": "Security Bootcamp",
    "author": {
      "name": "Morsalin",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "",
    "course_description": "Hello! Have you ever dreamed of getting started with Information Security or becoming a Cybersecurity Professional, but you don’t know where to start? Then you’ve come to the right place! Introducing your all-in-one course to get you up and running with information Security, cybersecurity, computer networking, and ethical hacking.You will learn the entire Information Security including Risk management, security assessment, Identity access management, cybersecurity fundamentals as well as ethical hacking concepts such as web application penetration testing, database hacking, penetration tests, and much more. I strongly believe in learning by doing, so you will acquire real-world skills by following the hands-on practical lectures."
  }
]
