[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab1a",
    "course_id": "01",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 9.99,
    "course_title": "Modern HTML & CSS",
    "author": {
      "name": "Brad Traversy",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/x3cVXyB/1-dq-LV7-Kj-Utg57-JPBCilqx-SQ.jpg",
    "course_description": "Build modern responsive websites & UIs with HTML5, CSS3 & Sass! Learn Flex & CSS Grid. Become a modern and confident html and css developer no prior knowledge needed! Design and build a stunning real-world project for your portfolio from scratch. Modern, semantic, and accessible HTML5. Modern CSS (previous CSS3), including flexbox and CSS Grid for layout. Important CSS concepts such as the box model, positioning schemes, inheritance, solving selector conflicts, etc.. A web design framework with easy-to-use rules and guidelines to design eye-catching websites. How to plan, sketch, design, build, test, and optimize a professional website, and how to make websites work on every possible mobile device (responsive design). How to use standard components and layout patterns for professional website design and development. Developer skills such as reading documentation, debugging, and using professional tools. Find and use free design assets such as images, fonts, and icons. Practice your skills with 10+ challenges (solutions included)"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab2a",
    "course_id": "01",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 3.99,
    "course_title": "Javascript for Beginners",
    "author": {
      "name": "Dollar Design School",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/KD4xPtH/what-is-javascript-used-for.png",
    "course_description": "Take this Javascript training course and start learning Javascript today. As a business guy, I have no place in programming. Ten years ago you could have gotten away with that statement. Today you say that to your colleagues and they scoff at you before they go back to their computers to fix problems and do real work. If you want to do something useful start by learning Javascript. These days when the browser is central to all computer use, knowing the browser's language is the most important step. A few years ago Javascript potential was uncertain and many programmers considered it useless. These days however competent programmers have identified Javascript's real potential and use and it has gone from a toy language to the main language of the browser. It has become one of the most useful languages of this era. Every developer needs at least a basic understanding of Javascript. A developer who knows Javascript is the rockstar of the company and is in constant demand by employers"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab3a",
    "course_id": "01",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 4.99,
    "course_title": "AJAX Development",
    "author": {
      "name": "Mark Lassoff",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/vcqNF0Z/img-ajax.jpg",
    "course_description": "You’ve learned a little about Javascript,  but you still look at websites with slick, smooth, and elegant user interfaces and want to know how web developers create that. The answer is simple: Ajax.  You’ve probably heard of it, but you’ve always wondered “What is Ajax”? Ajax is simply Asynchronous Javascript and XML. By taking our Ajax course, you can make pages on your web application respond quickly, and with a minimum of screen refreshes. With our Ajax course and a little Javascript knowledge, you can use Ajax to take database information and store, alter, sort, and conditionally format it all on the client side.  This minimizes the load on your server and makes your applications respond quickly and without reloading the HTML page.  Ajax communicates with the server behind the scenes while your user continues to use your website, accessing the information they want. Our course will show you numerous Ajax examples and help you become proficient in using Ajax"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab4a",
    "course_id": "01",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 7.99,
    "course_title": "Modern React",
    "author": {
      "name": "Stiphen Grider",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/zXvFTmB/default-social-1-8644cb76eb27911e855db3b3e58503fc.png",
    "course_description": "Congratulations!  You've found the most popular, most complete, and most up-to-date resource online for learning React and Redux!. Thousands of other engineers have learned React and Redux, and you can too.  This course uses a time-tested, battle-proven method to make sure you understand exactly how React and Redux work, and will get you a new job working as a software engineer or help you build that app you've always been dreaming about. The difference between this course and all the others: you will understand the design patterns used by top companies to build massively popular web apps."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab5a",
    "course_id": "01",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 2.99,
    "course_title": "Node.js Developer",
    "author": {
      "name": "Andrew Mod",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/bmgdjQF/nodejs-cover-photo-smaller-size.png",
    "course_description": "The Complete Node.js Developer Course covers the fundamentals of Node before diving deep into great tools like Express, Mongoose, and MongoDB. The entire course is based around a single goal: Turning you into a professional Node developer capable of developing, testing, and deploying real-world production applications. The best way to learn Node is by building Node apps. From the very start you’ll be programming every project and working through challenges that I’ve designed to reinforce what you’ve learned. This will give you the hands-on experience necessary to be able to create and launch your own project once you’re done."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "course_id": "01",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 10.99,
    "course_title": "React Native",
    "author": {
      "name": "Maximilian Schwarzmüller",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/qBwpWDw/1-k-Q11-TLArd7x-Gu-Wi-Som-BSg.png",
    "course_description": "Mobile apps are one of the best ways to engage with users - no wonder everyone wants to build one! Wouldn't it be great if you could use your web development knowledge, combined with your React knowledge, to build mobile apps with that? That's exactly what React Native allows you to do! No need to learn Java, Android, Swift, Objective-C, or anything of that - React and JavaScript is all you need to create awesome native mobile apps that work on both Android and iOS. That's probably the reason why Instagram, Airbnb, Skype, and many other global companies are using it to build their mobile apps! With this course, you can join this league. I'll teach you all you need to create your own React Native apps, publish them to the Google Play Store and Apple App Store and dive really deep into the React Native ecosystem."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab11",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 9.99,
    "course_title": "Hackers Exposed!",
    "author": {
      "name": "Nethan House",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/rfhbh7H/11f15424-4afe-43c2-a4c7-ce1fa4e94e44.jpg",
    "course_description": "Learn a practical skill set in defeating all online threats, including - advanced hackers, trackers, malware, zero days, exploit kits, cybercriminals, and more. Become a Cyber Security Specialist - Go from beginner to advance in this easy-to-follow expert course. Covering all major platforms - Windows 7, Windows 8, Windows 10, macOS, and Linux. This course covers the fundamental building blocks of your required skill set - You will understand the threat and vulnerability landscape through threat modeling and risk assessments. We explore the Darknet and the mindset of the cyber-criminal. Covering malware, exploit kits, phishing, zero-day vulnerabilities, and much more. You will learn about the global tracking and hacking infrastructures that nation-states run. Covering the NSA, FBI, CIA, GCHQ, China’s MSS, and other intelligence agencies' capabilities. You will understand the foundations of operating system security and privacy functionality. A close look at the new Windows 10 privacy issues and how to best mitigate them. There is a complete easy-to-follow crash course on encryption, how encryption can be bypassed and what you can do to mitigate the risks."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab22",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 3.99,
    "course_title": "Network Security!",
    "author": {
      "name": "Muhit sharma",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/yyZ1Sdv/Blog-Image-Network-Security.png",
    "course_description": "Become a cyber security specialist. After this course, you will be able to discover security vulnerabilities across an entire network, by using network hacking techniques and vulnerability scanning. You will be able to architect your network for maximum security and prevent local and remote attacks. We also cover the use of custom router firmware to provide you with better network security services. You will understand the various types of firewalls that are available and what threats each help mitigate. Including layer 4 firewalls like Iptables on Linux and PF on MacOS and BSD. Virtual firewalls, host-based firewalls, and application-based firewalls like Pence. We cover firewalls on all platforms including Windows, Mac OS X, and Linux for all types of use scenarios."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab33",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 4.99,
    "course_title": "Anonymous Browsing!",
    "author": {
      "name": "Rohit",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/Ryg5jH0/anonymous-browsing-3-1024x551.jpg",
    "course_description": "Advanced anonymity: We explore chaining and nesting anonymizing services together to provide layers of obfuscation for maximum anonymity against even the most well-resourced adversaries. We cover bypassing censors, firewalls, and proxies. Learn to bypass the trickiest of censoring devices including DPI (deep packet inspection). The course covers both the theory and practically how setup everything we discuss.   "
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab44",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 7.99,
    "course_title": "End Point Protection!",
    "author": {
      "name": "Rakib",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/YT9Dpfx/endpoints.png",
    "course_description": "Learn a practical skill set in securing laptops, desktops, and mobile devices from all types of threats, including, advanced hackers, trackers, exploit kits, thieves, and much more. In this course, we cover end-point-protection, which is an extremely important and hot topic in cyber security right now! Become a cyber security specialist - Go from beginner to advance in this easy-to-follow expert course. Covering all the major platforms Windows, macOS, Linux, iOS, and Android. Master the selection and implementation of solid disk encryption technology to protect devices from disk decryption attacks."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab55",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 2.99,
    "course_title": "Ethical Hacking",
    "author": {
      "name": "Jorge",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/y4q3ZZq/360-F-505395943-l1jwu722-NBo-I73-Cf-NJDb1-C0-Hw4lq-Gsf-P.jpg",
    "course_description": "What will you learn in this “Complete Ethical Hacking and Cyber Security Master Class. In short, you'll learn it all! Seriously, our goal is to make the most comprehensive Ethical Hacking course out there - not filled with fluff, but filled with only the most actionable and latest tips and strategies. We'll be updating this course periodically to make sure we're covering any change with Ethical Hacking and Cyber Security. You'll start by an overview of Ethical Hacking and Cyber security, learn 2 types of attacks, install Virtual Box 6.0 and Kali Linux. You'll then learn Linux basics like the Linux environment, terminal commands, configuring IP addresses and network settings, Cat, Echo, APT-get and more…"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab66",
    "course_id": "02",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 10.99,
    "course_title": "Security Bootcamp",
    "author": {
      "name": "Morsalin",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/mBsbmhm/download.jpg",
    "course_description": "Hello! Have you ever dreamed of getting started with Information Security or becoming a Cybersecurity Professional, but you don’t know where to start? Then you’ve come to the right place! Introducing your all-in-one course to get you up and running with information Security, cybersecurity, computer networking, and ethical hacking.You will learn the entire Information Security including Risk management, security assessment, Identity access management, cybersecurity fundamentals as well as ethical hacking concepts such as web application penetration testing, database hacking, penetration tests, and much more. I strongly believe in learning by doing, so you will acquire real-world skills by following the hands-on practical lectures."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab111",
    "course_id": "03",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 9.99,
    "course_title": "C Programming",
    "author": {
      "name": "Rakib Hasan",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/zGyMDNG/retina-1708x683-cover-0828-After-All-These-Yearsthe-Worldis-Still-Poweredby-CProgramming-Razvan-News.png",
    "course_description": "Have you never programmed a computer before, and think or have been told that C is a good programming language to get started with.  It is! Maybe you have some experience with other programming languages, but want to learn C.  It's a great language to add to your resume! Or perhaps you are stuck in a low paying programming job, and want to move up to a better, more senior position.  Learning C can help you!"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab222",
    "course_id": "03",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 3.99,
    "course_title": "C++ Programming",
    "author": {
      "name": "Rakib Hasan",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/mcpgqkZ/1522635669452-11.webp",
    "course_description": "Which programming language is often seen as a badge of honor among software developers?  C++ Which programming language can you learn that when added to your resume,  will often get you a job interview?  C++  Which programming language is routinely ranked in the top 5 programming languages by popularity, and been consistently in the top 10 for close to 20 years?  C++"
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab333",
    "course_id": "03",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 4.99,
    "course_title": "Java Programming ",
    "author": {
      "name": "Rakib Hasan",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/ssnxdPw/download-1.jpg",
    "course_description": "Are you aiming to get your first Java Programming job but struggling to find out what skills employers want and which course will give you those skills? This course is designed to give you the Java skills you need to get a job as a Java developer.  By the end of the course, you will understand Java extremely well and be able to build your own Java apps and be productive as a software developer."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab444",
    "course_id": "03",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 7.99,
    "course_title": "Learn Python",
    "author": {
      "name": "Rakib Hasan",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/HqN5TwY/b5f62d16-ac55-4b5f-ab39-d19dc635d158-ad1d78dfab3a.webp",
    "course_description": "This course is aimed at complete beginners who have never programmed before, as well as existing programmers who want to increase their career options by learning Python. The fact is, Python is one of the most popular programming languages in the world – Huge companies like Google use it in mission critical applications like Google Search. And Python is the number one language choice for machine learning, data science and artificial intelligence. To get those high paying jobs you need an expert knowledge of Python, and that's what you will get from this course."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab555",
    "course_id": "03",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 2.99,
    "course_title": "Code with Ruby",
    "author": {
      "name": "Rakib Hasan",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/HNnqrxX/eb9e3b7dab09358e7cf13f188f64f9f4.png",
    "course_description": "The most comprehensive Ruby course available on Udemy! An in-depth overview of coding with Ruby, a popular programming language renowned for its simplicity and elegance. Whether you've never written a line of code before or are looking to learn a brand new language, this course covers all bases! Learn to Code with Ruby offers more than 30+ hours of video tutorials, 250+ lectures, and dozens of quizzes and exercises to test your knowledge as you proceed through the course."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab666",
    "course_id": "03",
    "rating": { "number": 4.4, "badge": "Excellent" },
    "total_purchase": 1320,
    "price": 10.99,
    "course_title": "C# Masterclass",
    "author": {
      "name": "Rakib Hasan",
      "published_date": "2022-08-24 17:27:34"
    },
    "image_url": "https://i.ibb.co/RTkzqDc/retina-1708x683-cover-0219-The10-Mistakes-C-Waldek-img-343f93efd75d26a7d857e374cd8630fd.png",
    "course_description": "Maybe you want to work as a developer? Then you are in the right place. In this course, you are going to discover how to become a c# developer - one of the best programming languages on earth! C# is one of the few programming languages which allows you to create amazing cross-platform Mobile Apps, Games, and PC Programs. Bringing an Idea to life is one of the best feelings one can have, but the path to get there is often full of challenges. So I have created a course that makes this path as easy as possible all with the help of c# so that you become a skilled c# developer!"
  }
]
